{
  "basics": {
    "name": "Everton José da Silva",
    "email": "evertonjosedasilva570@gmail.com",
    "phone": "",
    "website": "https://evertonjdasilva.github.io/",
    "summary": "Ph.D. Candidate in Mathematics at NOVA University of Lisbon, focusing on research in   Optimization. He holds a bachelor's and a master’s in Mathematics from the Federal University of Paraná, Brazil, and his work has received recognition, including the Curta Ciência Award 2021 for excellence in research. Supported by a scholarship from the Foundation for Science and Technology (FCT), Portugal, he is finalizing his doctoral thesis at the Center for Mathematics and Applications (NOVA MATH). Everton’s research interests lie in optimization, modeling, algorithmic development, and computational implementation, particularly within nonlinear optimization, including derivative-free and multiobjective optimization.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Almada",
      "countryCode": "PT",
      "region": "Setúbal"
    },
    "profiles": [
      {
        "network": "Google Scholar",
        "username": "Everton J. Silva",
        "url": "https://scholar.google.com/citations?view_op=list_works&hl=pt-BR&user=MywXxlwAAAAJ"
      },
      {
        "network": "ORCID",
        "username": "Everton Silva",
        "url": "https://orcid.org/0000-0002-3627-3030"
      },
      {
        "network": "GitHub",
        "username": "EvertonJdaSilva",
        "url": "https://github.com/EvertonJdaSilva"
      }
    ]
  },
  "work": [ ],
  "education": [
    {
      "institution": "NOVA University of Lisbon",
      "area": "Ph.D in Mathematics",
      "studyType": "Constrained Multiobjective Derivative-free Optimization",
      "startDate": "2020",
      "endDate": "2025",
      "gpa": null,
      "courses": ["Decision Sciences", "Modeling in Operations Research", "Graph Theory", "Topics in Combinatorial Optimization", "Topics in Nonlinear Optimization", "Seminar in Operations Research"]
    },
    {
      "institution": "Federal University of Paraná",
      "area": "M.S. in Mathematics",
      "studyType": "Integral Characterizations for Global Optimality: Mono and Multiobjective Cases (in Portuguese)",
      "startDate": "2018",
      "endDate": "2020",
      "gpa": null,
      "courses": ["Analysis in Rn", "Applied Linear Algebra", "Supervised Internship in Teaching Practice", "Operational Research", "Special Topics in Optimization: Global Optimality for Single and Multi-Objective Problems", "Applied Differential Equations"]
    },
    {
      "institution": "Federal University of Paraná",
      "area": "B.S. in Mathematics",
      "studyType": "Qualification Conditions for Nonlinear Programming Problems (in Portuguese)",
      "startDate": "2014",
      "endDate": "2018",
      "gpa": null,
      "courses": ["Linear Algebra I", "Calculus (I, II, III)", "Mathematical Supplements", "Functions", "Fundamentals of Geometry", "Analytical Geometry", "Geometric Drawing (I, II)", "Statistics II", "Physics (I, II, III)", "Number Theory", "Topics of Mathematics I", "Mathematical Supplements", "Dynamic Geometry", "Ring Theory", "Didactics", "Fundamentals of Analysis", "Geometry in Education", "Brazilian Education Policy and Planning", "Educational Psychology", "Group Theory", "Analysis on the Line", "Supervised Internship in Interactive Processes in Education", "Mathematics in Elementary Education", "Mathematics Teaching Methodology", "Organization of Pedagogical Work in School", "Research in Mathematics Education", "Ring Theory", "Probability Calculus A", "Mathematics in High School", "Teaching Practice in Mathematics (I, II)", "Euclidean and Non-Euclidean Geometries", "Introduction to Differential Equations Partial"]
    }
  ],
  "skills": [],
  "languages": ["Portuguese", "English"],
  "interests": ["My research interests primarily focus on nonlinear optimization, specifically in the areas of: Derivative-free optimization, Nonlinear Optimization, Global optimization, Constrained optimization, Multi-objective optimization, and Many-objective optimization"],
  "references": [],
  "publications": [
    {
      "name": "Nonlinear Derivative-free Constrained Optimization with a Penalty-Interior Point Method and Direct Search",
      "publisher": "arXiv",
      "releaseDate": "2025-04-24",
      "website": "http://academicpages.github.io/files/Brilli_Custodio_Liuzzi_Silva_2025.pdf",
      "summary": "In this work, we propose the joint use of a mixed penalty-interior point method and direct search, for addressing nonlinearly constrained derivative-free optimization problems. A merit function is considered, wherein the set of nonlinear inequality constraints is divided into two groups: one treated with a logarithmic barrier approach, and another, along with the equality constraints, addressed using a penalization term. This strategy, is adapted and incorporated into a direct search method, enabling the effective handling of general nonlinear constraints. Convergence to KKT-stationary points is established under continuous differentiability assumptions, without requiring any kind of convexity. Using CUTEst test problems, numerical experiments demonstrate the robustness, efficiency, and overall effectiveness of the proposed method, when compared with state-of-the-art solvers."
    },
    {
      "name": "An Inexact Restoration Direct Multisearch Filter Approach to Multiobjective Constrained Derivative-free Optimization",
      "publisher": "Optimization Methods and Software",
      "releaseDate": "2024-10-29",
      "website": "http://academicpages.github.io/files/DMSFILTERIR_Silva_Custodio.pdf",
      "summary": "Direct Multisearch (DMS) is a well-established class of methods for multiobjective derivative-free optimization, where constraints are addressed by an extreme barrier approach, only evaluating feasible points. In this work, we propose the replacement of this extreme barrier approach by a filter strategy, combined with an inexact feasibility restoration step, to address constraints in the DMS framework. The filter approach treats feasibility as an additional component of the objective function that needs to be minimized. The inexact restoration step attempts to generate new feasible points, contributing to prioritize this feasibility, a requirement for the good performance of any filter approach. Theoretical results are provided, analysing the different types of sequences of points generated by the new algorithm, and numerical experiments on a set of nonlinearly constrained biobjective problems are reported, stating the good algorithmic performance of the proposed approach."
    },
    {
      "name": "Integral Global Optimality Conditions and an Algorithm for Multiobjective Problems",
      "publisher": "Numerical Functional Analysis and Optimization",
      "releaseDate": "2022-07-18",
      "website": "http://academicpages.github.io/files/Silva_Karas_Santos_2022.pdf",
      "summary": "In this work, we propose integral global optimality conditions for multiobjective problems not necessarily differentiable. The integral characterization, already known for single objective problems, are extended to multiobjective problems by weighted sum and Chebyshev weighted scalarizations. Using this last scalarization, we propose an algorithm for obtaining an approximation of the weak Pareto front whose effectiveness is illustrated by solving a collection of multiobjective test problems."
    },  
    {
      "name": "Desenvolvimento de Projetos em Robótica Educacional A inserção da Expressão Gráfica no ensino",
      "publisher": "Anais da X Conferência Latino-Americana de Objetos e Tecnologias de Aprendizagem (LACLO 2015)",
      "releaseDate": "2015",
      "website": "http://academicpages.github.io/files/LACLO_2015.pdf",
      "summary": "This paper describes the implementation of projects development in the classroom using educational robotics as tool. The project-based learning shows as a great pedagogical practice to re-enchant the classrooms, in addition to providing a development of the currently required intellectual abilities. The experiment conducted consisted of a simple challenge, which students should solve using a robot, to develop the robot were used the methodologies of brainstorm and morphological matrix. At the end it was concluded that the proposal was satisfactory to be able to play an interdisciplinary activity, where the contents were experienced with meaning and intellectual and social skills were worked instinctively."
    }
  ],
  "presentations": [
    {
      "name": "Talk 1 on Relevant Topic in Your Field",
      "event": "UC San Francisco, Department of Testing",
      "date": "2012-03-01",
      "location": "San Francisco, CA, USA",
      "description": ""
    },
    {
      "name": "Tutorial 1 on Relevant Topic in Your Field",
      "event": "UC-Berkeley Institute for Testing Science",
      "date": "2013-03-01",
      "location": "Berkeley, CA, USA",
      "description": ""
    },
    {
      "name": "Talk 2 on Relevant Topic in Your Field",
      "event": "London School of Testing",
      "date": "2014-02-01",
      "location": "London, UK",
      "description": ""
    },
    {
      "name": "Conference Proceeding talk 3 on Relevant Topic in Your Field",
      "event": "Testing Institute of America 2014 Annual Conference",
      "date": "2014-03-01",
      "location": "Los Angeles, CA, USA",
      "description": ""
    }
  ],
  "teaching": [
    {
      "course": "Teaching experience 1",
      "institution": "University 1, Department",
      "date": "2014-01-01",
      "role": "Undergraduate course",
      "description": ""
    },
    {
      "course": "Teaching experience 2",
      "institution": "University 1, Department",
      "date": "2015-01-01",
      "role": "Workshop",
      "description": ""
    }
  ],
  "portfolio": [
    {
      "name": "Portfolio item number 1",
      "category": "portfolio",
      "date": "",
      "url": "",
      "description": "Short description of portfolio item number 1<br/><img src='/images/500x300.png'>"
    }
  ]
}